app/controllers/wasted_hours_controller.rb

SELECT "lost_works".* FROM "lost_works"
---
  def index
    header = TableHeader.new
    @table_header =  header.table_header
    @table_body = LostWork.all

INSERT INTO "lost_productivities" ("created_at", "description", "hours_lost_per_employee", "problem_category", "total_employees_affected", "total_hours_lost_employees", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "lost_works" ("created_at", "description", "hours_lost_per_employee", "incident_date", "problem_category", "team_name", "total_employees_affected", "total_hours_lost_employees", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def process_new_form
    LostWork.create do |lost_productivity|

SELECT "lost_works".* FROM "lost_works"
---
  def delete_column
    header = TableHeader.new
    @table_header =  header.table_header_delete
    @table_body = LostWork.all

DELETE FROM "lost_works" WHERE "lost_works"."id" = $1  [["id", 2]]
SELECT  "lost_works".* FROM "lost_works"  WHERE "lost_works"."id" = $1 LIMIT 1  [["id", 2]]
---
  def delete_column_action
    field_id = params[:id]
    LostWork.find(field_id).destroy