app/controllers/wasted_hours_controller.rb

SELECT "lost_productivities".* FROM "lost_productivities"
---
  def index
    header = TableHeader.new
    @table_header =  header.table_header
    @table_body = LostProductivity.all

DELETE FROM "lost_productivities"
---
  def admin_factory_reset
    LostProductivity.delete_all